// 0. Демонстрация решения
// Напишите программу, которая на вход
// 1 принимает число и 
// 2 умноженное на само себя).
// 3 выдаёт его квадрат (число

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

Console.Write("Введите целое число: ");
int numA = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"Квадрат числа {numA} равен {numA*numA}");

